JOB_CHOICES = [
    ("학생또는취업준비생", "학생 또는 취업준비생"),
    ("가정주부", "가정주부"),
    ("직장인", "직장인"),
    ("기타", "기타"),
]

FAMILY_AMOUNT_CHOICES = [
    (1, "1명"),
    (2, "2명"),
    (3, "3명"),
    (4, "4명"),
    (5, "5명 이상"),
]

Q1_CHOICES = [
    ("E", "친구들 혹은 가족들과 함께 간다."),
    ("I", "혼자만의 시간을 즐긴다."),
]

Q2_CHOICES = [
    ("J", "구매할 것들을 목록에 적는다."),
    ("P", "시장에 가서 생각한다."),
]

Q3_CHOICES = [
    ("J", "구매할 것들을 적은 목록에 있는 것들 먼저 구매한다."),
    ("P", "구경 먼저하고 나중에 필요한 산다."),
]

Q4_CHOICES = [
    ("S", "다른 곳에서 시간 때우다 다시 온다."),
    ("N", "새로운 곳에 가본다."),
]

Q5_CHOICES = [
    ("E", "사장님! 여기서 제일 잘나가는 물건 뭐에요?."),
    ("I", "나 혼자 쇼핑하고 싶은데...ㅆㅆ;;."),
]

Q6_CHOICES = [
    ("E", "전동시장은 흥정하는 맛이지~~."),
    ("I", "가격이 적힌대로 산다."),
]

Q7_CHOICES = [
    ("S", "'어 저걸로 살까?' 잘나가는 메뉴를 고른다"),
    ("N", "'그렇군!' 내가 먹고싶은 것을 고른다."),
]

Q8_CHOICES = [
    ("S", "다른 상점과 비교하고 구매한다."),
    ("N", "이거 괜찮은데?. 그냥 바로 구매."),
]

Q9_CHOICES = [
    ("T", "평소처럼 카드를 내민다."),
    ("F", "'상인분들이 현금결제를 하면 좋아하겠지?' 현금결제한다."),
]

Q10_CHOICES = [
    ("J", "SNS를 검색해 맛집을 찾는다."),
    ("P", "맛있는 냄새를 따라 식당을 찾아간다."),
]

Q11_CHOICES = [
    ("T", "각자 먹고 싶은 메뉴 먹자!"),
    ("F", "그래 너희 먹고 싶은거 먹자~"),
]

Q12_CHOICES = [
    ("T", "필요한 물건 저렴한 가격에 잘 구매했네!"),
    ("F", "시장에서 흥정도 하고 사진도 찍고 뿌듯하고 즐거운 하루였어!"),
]

# 간이서랍 건강기능식품 공구 냄비 모종(씨)/화분 바구니 볼펜 부채 세제   수건   수영모   슬리퍼   시계   안경   양말   운동복   이불   잠옷
# 조명/스탠드   청소용밀대   칼   커텐   쿠션   통기타   팔토시   편한바지   화장품
# (물)회   김치   꽈배기   냉면   냉채족발   닭볶음탕   돈까스   떡볶이   모둠전(부침개)   불고기   붕어빵   뼈해장국   삼겹살   샐러드(야채)
# 생선구이   설렁탕   수박화채   순대   식혜   아구찜   잔치국수   제육볶음   짜장면   치킨   해물칼국수   해물탕

FOOD1_CHOICES = [
    ("냉채족발", "냉채족발"),
    ("닭볶음탕", "닭볶음탕"),
    ("돈까스", "돈까스"),
    ("불고기", "불고기"),
    ("뼈해장국", "뼈해장국"),
    ("삼겹살", "삼겹살"),
    ("설렁탕", "설렁탕"),
    ("제육볶음", "제육볶음"),
    ("치킨", "치킨"),
    ("(물)회", "(물)회"),
    ("생선구이", "생선구이"),
    ("아구찜", "아구찜"),
    ("해물칼국수", "해물칼국수"),
    ("해물탕", "해물탕"),
    ("꽈배기", "꽈배기"),
    ("냉면", "냉면"),
    ("떡볶이", "떡볶이"),
    ("모둠전(부침개)", "모둠전(부침개)"),
    ("붕어빵", "붕어빵"),
    ("샐러드(야채)", "샐러드(야채)"),
    ("수박화채", "수박화채"),
    ("순대", "순대"),
    ("식혜", "식혜"),
    ("잔치국수", "잔치국수"),
    ("짜장면", "짜장면"),
]

FOOD2_CHOICES = [
    ("냉채족발", "냉채족발"),
    ("닭볶음탕", "닭볶음탕"),
    ("돈까스", "돈까스"),
    ("불고기", "불고기"),
    ("뼈해장국", "뼈해장국"),
    ("삼겹살", "삼겹살"),
    ("설렁탕", "설렁탕"),
    ("제육볶음", "제육볶음"),
    ("치킨", "치킨"),
    ("(물)회", "(물)회"),
    ("생선구이", "생선구이"),
    ("아구찜", "아구찜"),
    ("해물칼국수", "해물칼국수"),
    ("해물탕", "해물탕"),
    ("꽈배기", "꽈배기"),
    ("냉면", "냉면"),
    ("떡볶이", "떡볶이"),
    ("모둠전(부침개)", "모둠전(부침개)"),
    ("붕어빵", "붕어빵"),
    ("샐러드(야채)", "샐러드(야채)"),
    ("수박화채", "수박화채"),
    ("순대", "순대"),
    ("식혜", "식혜"),
    ("잔치국수", "잔치국수"),
    ("짜장면", "짜장면"),
]

FOOD3_CHOICES = [
    ("냉채족발", "냉채족발"),
    ("닭볶음탕", "닭볶음탕"),
    ("돈까스", "돈까스"),
    ("불고기", "불고기"),
    ("뼈해장국", "뼈해장국"),
    ("삼겹살", "삼겹살"),
    ("설렁탕", "설렁탕"),
    ("제육볶음", "제육볶음"),
    ("치킨", "치킨"),
    ("(물)회", "(물)회"),
    ("생선구이", "생선구이"),
    ("아구찜", "아구찜"),
    ("해물칼국수", "해물칼국수"),
    ("해물탕", "해물탕"),
    ("꽈배기", "꽈배기"),
    ("냉면", "냉면"),
    ("떡볶이", "떡볶이"),
    ("모둠전(부침개)", "모둠전(부침개)"),
    ("붕어빵", "붕어빵"),
    ("샐러드(야채)", "샐러드(야채)"),
    ("수박화채", "수박화채"),
    ("순대", "순대"),
    ("식혜", "식혜"),
    ("잔치국수", "잔치국수"),
    ("짜장면", "짜장면"),
]

ITEM1_CHOICES = [
    ("간이서랍", "간이서랍"),
    ("공구", "공구"),
    ("냄비", "냄비"),
    ("바구니", "바구니"),
    ("볼펜", "볼펜"),
    ("부채", "부채"),
    ("세제", "세제"),
    ("수건", "수건"),
    ("시계", "시계"),
    ("이불", "이불"),
    ("조명/스탠드", "조명/스탠드"),
    ("청소용밀대", "청소용밀대"),
    ("칼", "칼"),
    ("커텐", "커텐"),
    ("쿠션", "쿠션"),
    ("건강기능식품", "건강기능식품"),
    ("슬리퍼", "슬리퍼"),
    ("안경", "안경"),
    ("양말", "양말"),
    ("운동복", "운동복"),
    ("잠옷", "잠옷"),
    ("팔토시", "팔토시"),
    ("편한바지", "편한바지"),
    ("화장품", "화장품"),
    ("모종(씨)/화분", "모종(씨)/화분"),
    ("수영모", "수영모"),
    ("통기타", "통기타"),
]

ITEM2_CHOICES = [
    ("간이서랍", "간이서랍"),
    ("공구", "공구"),
    ("냄비", "냄비"),
    ("바구니", "바구니"),
    ("볼펜", "볼펜"),
    ("부채", "부채"),
    ("세제", "세제"),
    ("수건", "수건"),
    ("시계", "시계"),
    ("이불", "이불"),
    ("조명/스탠드", "조명/스탠드"),
    ("청소용밀대", "청소용밀대"),
    ("칼", "칼"),
    ("커텐", "커텐"),
    ("쿠션", "쿠션"),
    ("건강기능식품", "건강기능식품"),
    ("슬리퍼", "슬리퍼"),
    ("안경", "안경"),
    ("양말", "양말"),
    ("운동복", "운동복"),
    ("잠옷", "잠옷"),
    ("팔토시", "팔토시"),
    ("편한바지", "편한바지"),
    ("화장품", "화장품"),
    ("모종(씨)/화분", "모종(씨)/화분"),
    ("수영모", "수영모"),
    ("통기타", "통기타"),
]

ITEM3_CHOICES = [
    ("간이서랍", "간이서랍"),
    ("공구", "공구"),
    ("냄비", "냄비"),
    ("바구니", "바구니"),
    ("볼펜", "볼펜"),
    ("부채", "부채"),
    ("세제", "세제"),
    ("수건", "수건"),
    ("시계", "시계"),
    ("이불", "이불"),
    ("조명/스탠드", "조명/스탠드"),
    ("청소용밀대", "청소용밀대"),
    ("칼", "칼"),
    ("커텐", "커텐"),
    ("쿠션", "쿠션"),
    ("건강기능식품", "건강기능식품"),
    ("슬리퍼", "슬리퍼"),
    ("안경", "안경"),
    ("양말", "양말"),
    ("운동복", "운동복"),
    ("잠옷", "잠옷"),
    ("팔토시", "팔토시"),
    ("편한바지", "편한바지"),
    ("화장품", "화장품"),
    ("모종(씨)/화분", "모종(씨)/화분"),
    ("수영모", "수영모"),
    ("통기타", "통기타"),
]
